lib/middleware/tenant_middleware.rb

SELECT "stores".* FROM "stores" WHERE "stores"."store_id" = 'store2' LIMIT 1
---
  def call(env)
    #binding.break
    rq = Rack::Request.new(env)

    store_id = rq.get_header("HTTP_X_TENANT")

    if store_id.blank?
      host = rq.host
      part = host.split(".")
      store_id = part[0]
    end

    CurrentTenant.tenant = Store.find_by(store_id: store_id)